<a href="https://colab.research.google.com/github/brendanpshea/database_sql/blob/main/Introduction_to_SQL_1_Books.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

# Introduction to Structured Query Language
### Brendan Shea, PhD (Brendan.Shea@rctc.edu)
This is the first in a set of interactive "lectures" designed to give you some examples of how "Structured Query Language" (SQL) works. Five quick notes about SQL:
1. SQL is a declarative, non-procedural programming language used to interact with relational databases. That is, you'll use SQL to tell the computer "what sort of infomration you want" and NOT "how to get this information." This is very different from procedural languages like Python or Java, and is much more closely related to areas like formal logic or set theory.
2. Like many programming languages, SQL is "standardized" by the American National Standards Institute (ANSI). This ensures that what much of you learn here will be generally applicable regardless of what particular relational database you wnat to work with.
3. SQL is simple! There are are relatively few commands (\< 100) in ANSI standard SQL and the vast majorrity of the work is done by 25 or so.
4. The fun (and challenge!) of SQL comes from trying to put these limited commands to work.You can learn the basics of SQL in 30 minutes. Learning to Wrie a correct, efficient SQL query can be a life's work.
5. These notes (as well as the accompanying labs) are delivered via a Python-based "Jupyter" notebook. You don't need to know any Python to use these notebooks. However, there are a very common way of doing data analysis, statistics, and data science. (So, I'd encourage you to play around with them).

Mainly, we'll be working through a series of sample queries, so you can get a sense of how SQL works.

## 1. Getting the Environment Set Up
Here, we're going to be setting SQLite as our relational database server. You don't really need to worry about the details, but basically we're going to:
1. Install Python utilities (`sqlalchemy` and `ipython` allowing use to interact with SQL more easily.
2. Load a sample SQLite database.


SQLite is frequently used for when a single user/application wants to access a database, and is one of the most commonly installed applications in modern computing (you probably have multiple copies on your phone/computer right now--you just don't know it!). 

Once we've started up SQLite, we'll load a sample "books" database for you to play with.

NOTE: Please don't alter the following code cells! I don't expect you to understand the details, but they are necessary to get the notebook ready to run SQL code.

## 1a. Run These Cells

In [5]:
# Some UNIX and Python utilites we need to install for the lab.
!pip install sqlalchemy --quiet
!pip install ipython-sql --quiet

# Now, let's load SQLite
%load_ext sql
%sql sqlite://

In [3]:
## Let's load our data!
%%sql 
DROP TABLE IF EXISTS Books;
DROP TABLE IF EXISTS Authors;
CREATE TABLE Authors(
   author_id INT PRIMARY KEY,
   name VARCHAR(128) UNIQUE,
   nationality CHAR(3),
   famous_quote VARCHAR(256),
   date_of_birth DATE,
   date_of_death DATE,
   gender CHAR(1)
);

DROP TABLE IF EXISTS Books;
CREATE TABLE Books(
   book_id INT PRIMARY KEY,
   title VARCHAR(128) UNIQUE,
   publication_date DATE,
   genres VARCHAR(64),
   pages INT,
   reading_grade_level REAL,
   avg_stars REAL, 
   num_reviews INT,
   author_id INT,
   FOREIGN KEY(author_id) REFERENCES Authors(author_id)
);


INSERT INTO Authors
VALUES
(1, 'William Shakespeare', 'ENG', 'To thine own self be true', '1564-04-26', '1616-04-23', 'M'),
(2, 'Plato', 'GRE', 'Be kind, for everyone you meet is fighting a hard battle', '0427-01-28', '0348-01-28', 'M'),
(3, 'George Eliot', 'ENG', 'It is never too late to be what you might have been', '1819-11-22', '1880-12-22', 'F'),
(4, 'Kazuo Ishiguro', 'JAP', 'She had become immeasurably old in a single year', '1954-11-08', NULL, 'M'),
(5, 'JK Rowling', 'ENG', 'Happiness can be found, even in the darkest of times, if one only remembers to turn on the light', '1965-07-31', NULL, 'F'),
(6, 'Terry Pratchett', 'ENG', 'Light thinks it travels faster than anything but it is wrong. No matter how fast light travels, it finds the darkness has always got there first, and is waiting for it', '1948-04-28', '2015-03-12', 'M'),
(7, 'Herman Melville', 'USA', 'It is better to fail in originality than to succeed in imitation', '1819-08-01', '1891-09-28', 'M'),
(8, 'Jane Austen', 'ENG', 'There is no charm equal to tenderness of heart', '1775-12-16', '1817-07-18', 'F'),
(9, 'JRR Tolkien', 'ENG', 'Not all those who wander are lost', '1892-01-03', '1973-09-02', 'M'),
(10, 'Margaret Atwood', 'CAN', 'A word after a word after a word is power', '1939-11-18', NULL, 'F'),
(11, 'Neil Gaiman', 'ENG', 'Fairy tales are more than true: not because they tell us dragons exist, but because they tell us dragons can be beaten', '1960-11-10', NULL, 'M'),
(12, 'George RR Martin', 'USA', 'A reader lives a thousand lives before he dies, said Jojen. The man who never reads lives only one', '1948-09-20', NULL, 'M'),
(13, 'Ursula Le Guin', 'USA', 'We live in capitalism, its power seems inescapable - but then, so did the divine right of kings', '1929-10-21', NULL, 'F'),
(14, 'Salman Rushdie', 'IND', 'A poets work is to name the unnameable, to point at frauds, to take sides, start arguments, shape the world, and stop it going to sleep', '1947-06-19', NULL, 'M'),
(15, 'Octavia Butler', 'USA', 'All that you touch, you Change. All that you Change, Changes you. The only lasting truth is Change. God is Change', '1947-06-22', '2006-02-24', 'F'),
(16, 'Lois McMaster Bujold', 'USA', 'I like good strong words that mean something', '1949-11-02', NULL, 'F'),
(17, 'George Orwell', 'ENG', 'All animals are equal but some animals are more equal than others', '1903-06-25', '1950-01-21', 'M'),
(18, 'Philip Pullman', 'ENG', 'After all, to the well-organized mind, death is but the next great adventure', '1946-10-19', NULL, 'M'),
(19, 'Judy Blume', 'USA', 'I’ve been absolutely terrified every moment of my life – and I’ve never let it keep me from doing a single thing I wanted to do', '1938-02-12', NULL, 'F'),
(20, 'Chinua Achebe', 'NGA', 'Story is life with the dull bits cut out', '1930-11-16', '2013-03-21', 'M'),
(21, 'Rudolph Carnap', 'GER', 'Empiricism, logical and mathematical constructions, and philosophical analysis form a harmonious unity.', '1891-05-18', '1970-09-14', 'M'),
(22, 'Kurt Vonnegut', 'USA', 'Yes, we are doomed, doomed to spend our lives living in tall towers and making money and not caring about anybody or anything.', '1922-11-11', '2007-04-11', 'M'),
(23, 'Jo Walton', 'ENG', 'A genre is defined by the boundaries of its fandom. When someone is part of a genre, stepping outside part of the world.', '1964-12-14', NULL, 'F'),
(24, 'Robert Lowell', 'USA', 'There is no money in poetry, but then there is no poetry in money, either.', '1917-01-03', '1977-12-12', 'M'),
(25, 'James Joyce', 'IRE', 'A man of genius makes no mistakes. His errors are volitional and are the portals of discovery.', '1882-02-02', '1941-01-13', 'M'),
(26, 'Emily Oster', 'USA', 'You can’t keep running from bad to worse forever.', '1975-10-05', NULL, 'F'),
(27, 'Theodore Seuss', 'USA', 'Dont cry because its over, smile because it happened', '1854-03-02', '1966-09-24', 'M'),
(28, 'Sylvia Plath', 'USA', 'I took a deep breath and listened to the old brag of my heart. I am, I am, I am.', '1932-10-27', '1963-02-11', 'F'),
(29, 'Charles Dickens', 'UK ', 'There is nothing in the world so irresistibly contagious as laughter and good humor.', '1812-02-07', '1870-06-09', 'M'),
(30, 'John Greene', 'USA', 'Maybe ever’thing does happen for the best. But it’s real hard to believe that when you’re looking back at your life going, ‘Oh man, I wish I’d done that differently.', '1977-07-17', NULL, 'M'),
(31, 'Stephen King', 'USA', 'Get busy living or get busy dying.', '1947-09-21', NULL, 'M'),
(32, 'Naomi Novik', 'USA', 'I know what it is to be young and to believe that everything, absolutely everything, is possible.', '1973-11-23', NULL, 'F'),
(33, 'Suzanne Collins', 'USA', 'I don’t want to lose you. And I don’t want to have to say goodbye.', '1962-08-11', NULL, 'F'),
(34, 'Oscar Wilde', 'UK ', 'I can resist everything except temptation.', '1854-10-16', '1900-11-30', 'M'),
(35, 'Alan Turing', 'ENG', 'Im not interested in doing something that someone else has done before.', '1912-06-23', '1954-06-07', 'M'),
(36, 'Leonard Cohen', 'CAN', 'There is a crack, a crack, in everything. Thats how the light gets in.', '1934-09-21', '2016-11-07', 'M'),
(37, 'Charles Baudelaire', 'FRA', 'The greatest trick the devil ever pulled was convincing the world he didnt exist.', '1821-04-09', '1867-08-31', 'M'),
(38, 'Guy Gavriel Kay', 'CAN', 'Stories are how we teach and how we learn.', '1954-11-07', NULL, 'M'),
(39, 'Hannah Arendt', 'GER', 'The sad truth is that most evil is done by people who never make up their minds to be good or evil.', '1906-10-14', '1975-12-04', 'F'),
(40, 'Rumi', 'TUR', 'Let the beauty of what you love be what you do.', '1207-09-30', '1273-12-17', 'M'),
(41, 'Khaled Hosseini', 'AFG', 'To be a human being is to endure much worse than this.', '1965-03-04', NULL, 'M'),
(42, 'Albert Camus', 'FRA', 'In the depth of winter, I finally learned that there was in me an invincible summer.', '1913-11-07', '1960-01-04', 'M');


  INSERT INTO Books
VALUES
(1, 'Henry V', '1599-10-15', 'Comedy, Drama, Historic', 129, 10.3, 4.38, 260408, 1),
(2, 'A Midsummer Nights Dream', '1596-08-15', 'Comedy, Drama, Fantasy', 122, 10.1, 4.18, 121418, 1),
(3, 'Macbeth', '1605-11-10', 'Comedy, Drama, Historic', 124, 9.9, 4.05, 220128, 1),
(4, 'Romeo and Juliet', '1597-02-14', 'Comedy, Drama, Historic', 131, 9.9, 4.15, 250953, 1),
(5, 'Othello', '1604-08-10', 'Comedy, Drama, Historic', 134, 9.8, 4.08, 206659, 1),
(11, 'The Republic', '0380-01-01 BC', 'Philosophy', 368, 8.2, 3.78, 307177, 2),
(12, 'Symposium', '0380-01-01 BC', 'Philosophy', 96, 8.1, 4.16, 131074, 2),
(21, 'Middlemarch', '1871-12-01', 'Historic', 904, 8.8, 3.99, 511790, 3),
(22, 'Silas Marner', '1861-12-01', 'Historic', 196, 8.1, 3.94, 186847, 3),
(23, 'The Mill on the Floss', '1860-01-01', 'Historic', 672, 8, 3.95, 373619, 3),
(24, 'Adam Bede', '1859-04-01', 'Historic', 608, 7.9, 3.91, 344421, 3),
(25, 'Daniel Deronda', '1876-01-01', 'Historic', 848, 7.7, 3.83, 359901, 3),
(26, 'Harry Potter and the Philosophers Stone', '1997-06-26', 'Fantasy', 223, 4.65, 4.54, 1839669, 5),
(27, 'Harry Potter and the Chamber of Secrets', '1998-07-02', 'Fantasy', 251, 4.65, 4.46, 1665754, 5),
(28, 'Harry Potter and the Prisoner of Azkaban', '1999-07-08', 'Fantasy', 317, 4.72, 4.53, 1777322, 5),
(29, 'Harry Potter and the Goblet of Fire', '2000-07-08', 'Fantasy', 636, 4.62, 4.54, 2273950, 5),
(33, 'The Color of Magic', '1983-05-08', 'Comedy, Fantasy, Satire, Parody', 224, 5, 4.06, 30617, 6),
(34, 'The Light Fantastic', '1986-10-01', 'Comedy, Fantasy, Satire, Parody', 256, 5, 4.05, 26371, 6),
(35, 'Equal Rites', '1987-05-05', 'Comedy, Fantasy, Satire, Parody', 224, 5, 4.18, 21444, 6),
(36, 'Mort', '1987-08-27', 'Comedy, Fantasy, Satire, Parody', 256, 5, 4.22, 21588, 6),
(37, 'Guards! Guards!', '1989-01-06', 'Comedy, Fantasy, Satire, Parody', 352, 5, 4.27, 25542, 6),
(187, 'Moby Dick', '1851-10-18', 'Adventure, fiction, sailors, whaling', 623, 10.8, 3.87, 230545, 7),
(38, 'Redburn', '1849-10-23', 'Adventure, fiction, sailors, whaling', 496, 8.3, 2.85, 6304, 7),
(39, 'White Jacket', '1850-02-23', 'Adventure, fiction, sailors, whaling', 496, 8.3, 3.37, 13890, 7),
(40, 'Typee', '1846-02-23', 'Adventure, fiction, sailors, whaling', 400, 8.6, 3.52, 18709, 7),
(41, 'Omoo', '1847-02-23', 'Adventure, fiction, sailors, whaling', 304, 8.3, 3.49, 13297, 7),
(42, 'Israel Potter', '1855-01-23', 'Adventure, fiction, sailors, whaling', 256, 7.8, 3.32, 7223, 7),
(43, 'The Hobbit', '1937-09-21', 'Adventure, childrens, fiction', 320, 8.8, 4.27, 3555338, 9),
(44, 'The Fellowship of the Ring', '1954-07-29', 'Adventure, childrens, fiction', 624, 8.9, 4.35, 2757293, 9),
(45, 'The Two Towers', '1954-11-17', 'Adventure, childrens, fiction', 352, 8.9, 4.24, 2523880, 9),
(46, 'The Return of the King', '1955-10-20', 'Adventure, childrens, fiction', 416, 8.9, 4.28, 2620957, 9),
(47, 'The Silmarillion', '1977-09-15', 'Adventure, childrens, fiction', 544, 8.3, 4.24, 256612, 9),
(48, 'Unfinished Tales of Numenor and Middle-earth', '1980-10-21', 'Adventure, childrens, fiction', 608, 8.3, 4.14, 26183, 9),
(49, 'The Golden Compass', '1995-11-01', 'Adventure, childrens, fantasy', 384, 7.9, 3.91, 1068181, 18),
(50, 'The Subtle Knife', '1997-09-01', 'Adventure, childrens, fantasy', 400, 7.9, 3.93, 1026815, 18),
(51, 'The Amber Spyglass', '2000-10-02', 'Adventure, childrens, fantasy', 576, 7.9, 4.01, 982295, 18),
(52, 'Lyras Oxford', '2003-11-04', 'Adventure, childrens, fantasy', 96, 7.9, 4.02, 63979, 18),
(53, ' Falling Free', '1988-09-01', 'Adventure, science fiction', 352, 8.6, 4.18, 78323, 16),
(54, 'Shards of Honor', '1986-09-01', 'Adventure, science fiction', 384, 8.6, 4.12, 82438, 16),
(55, 'Barrayar', '1991-09-01', 'Adventure, science fiction', 384, 8.6, 4.12, 81588, 16),
(56, 'The Warriors Apprentice', '1986-11-01', 'Adventure, science fiction', 288, 8.6, 4.16, 80937, 16),
(57, 'Ethan of Athos', '1986-12-01', 'Adventure, science fiction', 320, 8.6, 4.17, 78372, 16),
(58, 'Brothers in Arms', '1989-10-01', 'Adventure, science fiction', 464, 8.6, 4.16, 75159, 16),
(59, 'The Handmaids Tale', '1985-08-01', 'Dystopia, Feminism', 311, 11, 4.11, 867885, 10),
(60, 'Oryx and Crake', '2003-08-05', 'Post-apocalyptic fiction, Science fiction', 376, 11, 3.82, 228396, 10),
(61, 'The Blind Assassin', '2000-09-05', 'Historical fiction, Speculative fiction', 534, 12, 3.96, 208684, 10),
(62, 'Are You There God? It''s Me, Margaret.', '1970-10-12', 'Bildungsroman, Young adult fiction', 144, 7, 4.14, 146476, 19),
(63, 'Blubber', '1974-10-12', 'Social issues, Young adult fiction', 208, 9, 4.02, 92443, 19),
(64, 'Forever', '1975-10-12', 'Bildungsroman, Young adult fiction', 288, 10, 3.73, 81165, 19),
(65, 'Just As Long As We''re Together', '1987-10-12', 'Bildungsroman, Young adult fiction', 200, 8, 4.19, 70176, 19),
(66, 'Starring Sally J. Freedman as Herself', '1978-10-12', 'Bildungsroman, Young adult fiction', 320, 10, 3.9, 68118, 19),
(67, 'Superfudge', '1980-10-12', 'Bildungsroman, Young adult fiction', 176, 8, 4.21, 58465, 19),
(68, 'Tales of a Fourth Grade Nothing', '1972-10-12', 'Bildungsroman, Young adult fiction', 192, 8, 4.17, 58214, 19),
(69, 'Then Again, Maybe I Won''t', '1971-10-12', 'Bildungsroman, Young adult fiction', 160, 8, 4.14, 51431, 19),
(70, 'Wish You Were Here', '1987-10-12', 'Bildungsroman, Young adult fiction', 256, 9, 4.04, 47170, 19),
(71, 'Women and Men', '1987-06-01', 'Fiction', 368, 10, 3.11, 57788, 14),
(72, 'The Moor''s Last Sigh', '1995-08-01', 'Historical fiction', 528, 11, 3.8, 35936, 14),
(73, 'Midnight''s Children', '1981-06-02', 'Historical fiction, Magic realism', 592, 12, 4.1, 33894, 14),
(74, 'Shame', '1983-06-01', 'Fiction', 528, 11, 3.83, 28141, 14),
(75, 'Animal Farm', '1945-08-17', 'Allegory, Animal fiction, Political fable', 128, 8, 3.89, 219767, 17),
(76, 'Burmese Days', '1934-05-01', 'Colonialism', 288, 10, 3.7, 53393, 17),
(77, '1984', '1949-06-08', 'Dystopia, Political fiction', 272, 10, 4.15, 210565, 17),
(78, 'Coming Up for Air', '1939-06-01', 'Bildungsroman', 320, 10, 3.85, 50304, 17),
(79, 'Down and Out in Paris and London', '1933-01-01', 'Autobiography', 320, 10, 3.78, 48734, 17),
(80, 'Keep the Aspidistra Flying', '1936-06-01', 'Bildungsroman, Social criticism', 256, 9, 3.7, 44190, 17),
(81, 'The Road to Wigan Pier', '1937-03-01', 'Social criticism', 336, 10, 3.96, 44827, 17),
(82, 'Homeland', '1992-06-01', 'Bildungsroman', 448, 10, 4.04, 62962, 18),
(83, 'Lyrical Ballads', '1798-09-01', 'Poetry', 352, 9, 3.68, 24667, 18),
(84, 'No Longer at Ease', '1960-04-01', 'Fiction, Historical fiction, Literature', 252, 8.5, 3.9, 15303, 20),
(85, 'Arrow of God', '1964-04-01', 'Fiction, Historical fiction', 304, 8.25, 4, 12483, 20),
(86, 'Dawn', '1987-04-01', 'Science fiction', 296, 8, 4.4, 22971, 15),
(87, 'Adulthood Rites', '1988-04-01', 'Science fiction', 332, 8, 4.4, 18349, 15),
(88, 'Imago', '1989-04-01', 'Science fiction', 292, 8.25, 4.3, 19018, 15),
(89, 'Wild Seed', '1980-04-01', 'Science fiction', 340, 7.75, 4.3, 20778, 15),
(90, 'Mind of My Mind', '1977-04-01', 'Science fiction', 352, 8.25, 4.2, 25279, 15),
(91, 'A Game of Thrones', '1996-08-01', 'Fantasy, Historical fiction', 835, 7.5, 4.45, 864340, 12),
(92, 'A Clash of Kings', '1998-02-02', 'Fantasy, Historical fiction', 1008, 7.5, 4.51, 650821, 12),
(93, 'A Storm of Swords', '2000-10-08', 'Fantasy, Historical fiction', 1177, 7.5, 4.58, 905475, 12),
(94, 'A Feast for Crows', '2005-10-17', 'Fantasy, Historical fiction', 973, 7.5, 4.29, 1395105, 12),
(95, 'A Dance with Dragons', '2011-07-12', 'Fantasy, Historical fiction', 1040, 7.5, 4.36, 1246371, 12),
(96, 'American Gods', '2001-06-26', 'Fantasy, Literature', 635, 7.75, 4.11, 687448, 11),
(97, 'Anansi Boys', '2005-09-20', 'Fantasy, Literature', 384, 7.75, 3.93, 651478, 11),
(98, 'Neverwhere', '1996-09-10', 'Fantasy, Literature', 400, 7.75, 4.16, 657877, 11),
(99, 'Coraline', '2002-05-27', 'Fantasy, Literature', 192, 7.75, 4.05, 825266, 11),
(100, 'The Graveyard Book', '2008-09-30', 'Fantasy, Literature', 336, 7.75, 4.11, 660480, 11),
(101, 'Logical Syntax of Language', '1934-01-01', 'Philosophy', 277, 6.9, 4.04, 355, 21),
(102, 'Philosophical Foundations of Physics', '1966-01-01', 'Science', 192, 8.3, 4.18, 154, 21),
(103, 'Introduction to Semantics', '1942-01-01', 'Philosophy', 145, 7.8, 4.21, 170, 21),
(105, 'Slaughterhouse-five', '1969-01-01', 'Science fiction', 275, 6.7, 4.09, 126084, 22),
(106, 'The sirens of titan', '1959-01-01', 'Science fiction', 288, 7.1, 4.13, 101022, 22),
(107, 'The player of games', '1988-01-01', 'Science fiction', 482, 6.2, 4.37, 32679, 23),
(108, 'To say nothing of the dog', '1997-01-01', 'Science fiction', 488, 7.1, 4.38, 24497, 23),
(109, 'Life studies', '1959-01-01', 'Poetry', 86, 9, 3.9, 536, 24),
(110, 'For the union dead', '1964-01-01', 'Poetry', 69, 10.7, 4, 549, 24),
(111, 'Near the ocean', '1967-01-01', 'Poetry', 84, 9.2, 3.9, 508, 24),
(112, 'A portrait of the artist as a young man', '1916-01-01', 'Novel', 296, 8.8, 3.74, 30660, 25),
(113, 'Finnegans wake', '1939-01-01', 'Novel', 628, 8.6, 3.39, 21663, 25),
(114, 'Dubliners', '1914-01-01', ' Short story', 219, 8.3, 4.22, 41565, 25),
(115, 'Expecting better', '2013-01-01', 'Nonfiction', 378, 10, 4.26, 9978, 26),
(116, 'The Cat in the Hat', '1957-09-12', 'Fiction, Childrens', 57, 1.6, 4.23, 254215, 27),
(117, 'Green Eggs and Ham', '1960-08-12', 'Fiction, Childrens', 50, 2.3, 4.21, 188110, 27),
(118, 'Oh, the Places Youll Go!', '1990-01-22', 'Fiction, Childrens', 56, 3.7, 4.33, 174893, 27),
(119, 'One Fish Two Fish Red Fish Blue Fish', '1960-10-12', 'Fiction, Childrens', 61, 1.4, 4.23, 157212, 27),
(120, 'Fox in Socks', '1965-03-12', 'Fiction, Childrens', 48, 2.1, 4.17, 141327, 27),
(122, 'The Bell Jar', '1963-01-14', 'Fiction', 224, 11, 3.59, 58585, 28),
(123, 'Ariel', '1965-10-06', 'Fiction', 80, 9, 4.21, 22055, 28),
(124, 'The Great Expectations', '1861-12-03', 'Fiction', 368, 9, 3.99, 304371, 29),
(125, 'A Tale of Two Cities', '1859-04-30', 'Fiction', 448, 13, 4.05, 358022, 29),
(127, 'David Copperfield', '1850-11-14', 'Fiction', 896, 9, 4.01, 342910, 29),
(128, 'Oliver Twist', '1839-02-09', 'Fiction', 368, 9, 3.66, 307115, 29),
(129, 'Looking for Alaska', '2005-03-01', 'Fiction', 288, 7, 4.11, 516555, 30),
(130, 'Paper Towns', '2008-10-16', 'Fiction', 305, 7, 3.85, 549686, 30),
(131, 'Will Grayson, Will Grayson', '2010-04-06', 'Fiction', 368, 7, 3.85, 267131, 30),
(132, 'The Fault in Our Stars', '2012-01-10', 'Fiction', 336, 7, 4.34, 627395, 30),
(133, 'An Abundance of Katherines', '2006-09-21', 'Fiction', 229, 7, 3.53, 279890, 30),
(134, 'The Shining', '1977-01-28', 'Fiction', 638, 9, 4.15, 939767, 31),
(135, 'The Dark Tower I: The Gunslinger', '1982-10-01', 'Fiction', 224, 9, 4.25, 1246126, 31),
(136, 'Carrie', '1974-04-05', 'Fiction', 246, 9, 3.94, 914686, 31),
(137, 'The Stand', '1978-09-12', 'Fiction', 1216, 9, 4.34, 932762, 31),
(138, 'The Dark Tower II: The Drawing of the Three', '1987-05-01', 'Fiction', 288, 9, 4.28, 1113534, 31),
(139, 'The Dark Tower III: The Waste Lands', '1991-10-01', 'Fiction', 416, 9, 4.19, 1029230, 31),
(140, 'The Dark Tower IV: Wizard and Glass', '1997-10-01', 'Fiction', 752, 9, 4.27, 1037213, 31),
(141, 'The Dark Tower: The Wind Through the Keyhole', '2012-04-24', 'Fiction', 304, 9, 4.11, 1204164, 31),
(142, 'The Dark Tower V: Wolves of the Calla', '2003-11-05', 'Fiction', 752, 9, 4.27, 1032064, 31),
(143, 'The Dark Tower VI: Song of Susannah', '2004-06-03', 'Fiction', 688, 9, 4.22, 1020941, 31),
(144, 'The Dark Tower VII: The Dark Tower', '2004-09-04', 'Fiction', 848, 9, 4.29, 1063352, 31),
(145, 'Uprooted', '2015-05-19', 'Fantasy', 448, 8.13, 4.4, 126163, 32),
(146, 'Spinning Silver', '2018-07-10', 'Fantasy', 432, 8.13, 4.43, 81247, 32),
(147, 'Fire and Hemlock', '1985-10-01', 'Fantasy', 432, 8.13, 4.3, 15000, 32),
(148, 'To Say Nothing of the Dog', '1998-07-01', 'Fantasy', 480, 8.13, 4.17, 23346, 32),
(149, 'The Temeraire Series', '2007-04-24', 'Fantasy', 1568, 8.13, 4.45, 106987, 32),
(150, 'Victory of Eagles', '2008-04-15', 'Fantasy', 448, 8.13, 4.46, 106987, 32),
(151, 'The Hunger Games', '2008-09-14', 'Fantasy', 384, 8.13, 4.34, 693205, 33),
(152, 'Catching Fire', '2009-09-01', 'Fantasy', 391, 8.13, 4.3, 653052, 33),
(153, 'Mockingjay', '2010-08-24', 'Fantasy', 400, 8.13, 4.03, 612564, 33),
(154, 'The Ballad of Songbirds and Snakes', '2020-05-19', 'Fantasy', 464, 8.13, 3.59, 13894, 33),
(155, 'Gregor the Overlander', '2003-08-01', 'Fantasy', 304, 8.13, 4.23, 68059, 33),
(156, 'The Picture of Dorian Gray', '1890-06-20', 'Horror, Fiction', 3160, 6, 4.09, 53876, 34),
(157, 'The Importance of Being Earnest', '1895-02-14', 'Comedy, Drama', 160, 4, 4.13, 89840, 34),
(158, 'Lady Windermeres Fan', '1892-02-20', 'Comedy, Drama', 176, 3, 4.11, 44275, 34),
(159, 'On Computable Numbers', '1937-05-28', 'Mathematics', 112, 10, 4.57, 1175, 35),
(160, 'Computing machinery and intelligence', '1950-10-15', 'Philosophy', 117, 10, 4.27, 750, 35),
(161, 'The Favorite Game', '1962-09-01', 'Novel', 216, 9, 3.96, 64, 36),
(162, 'Beautiful Losers', '1966-09-01', 'Novel', 416, 10, 4.09, 1584, 36),
(163, 'Les Fleurs du mal', '1857-06-03', 'Poetry', 400, 8, 3.73, 2106, 37),
(164, 'Les Paradis artificiels', '1860-10-03', 'Poetry', 206, 9, 3.86, 1677, 37),
(165, 'The Summer Tree', '1984-01-01', 'Fantasy', 489, 10, 4.13, 3263, 38),
(167, 'The Wandering Hill', '2004-01-01', 'Fantasy', 528, 10, 4.17, 5103, 38),
(168, 'The Origins of Totalitarianism', '1951-01-01', 'Philosophy', 618, 9, 4.32, 3788, 39),
(169, 'The Human Condition', '1958-01-01', 'Philosophy', 502, 8, 4.11, 3999, 39);

SyntaxError: ignored

# 2. Getting to Know Our Tables
In this section, we'll get acquainted with the relational schema of our database, and start exploring it using SELECT commands. A SELECT commands is SQL's way of "Reading" data from the database. You'll notice I start each of the code cells with a %%sql or %sql, like so:

```
%%sql 
# Write your multline SQL query here
# Write your multline SQL query here
```
OR

```
%sql # A single-line SQL query here.
```



These **magic** commands "tells" the Python interpreter I want it to treat everything else in the cell as a special (in this case, SQL) command and NOT as ordinary Python.

## Examining the Database Schema
Let's begin by taking a look at what tables we have. The command you need here will vary by DBMS (and I won't ask you to do it on a lab/exam), but the general rule is that relational databases will store the "relational schema" for the tables in your database inside their own "system" tables (the documentation will tell you what the names of these tables are). And you can query these tables using SQL! 

Right now, though, I just want you to take a look at what tables we have and at the "CREATE" table statements that were originally used to create them. You'll notice that our (SIMPLE!) table has data types that include:
1. Strings of variable length (VARCHARS)
2. Strings of fixed length (CHARS)
3. Integers (INTEGERS)
4. Dates (DATES)

In [58]:
# This shows table schema. The commands here will depend on the DBMS
%%sql 
SELECT name AS "Table Name", sql AS "Schema of Table" 
  FROM sqlite_master 
  WHERE type = 'table';

SyntaxError: ignored

# 3. Using SELECT, LIMIT, and COUNT
A simple SELECT retrieves EVERY row from a table. It works like this:

```
# Show selected attributes for all rows
SELECT attribute_1, attribute_2, etc. FROM table;
 
# Show all attributes for all rows
SELECT * FROM table; 

# Just show me the first five rows
SELECT * FROM table LIMIT 5;

```

Let's see it in action!

In [4]:
# Retrieve the first five rows of the Authors table
%%sql 

SELECT * 
  FROM Authors
  LIMIT 5;

 * sqlite://
Done.

[(1, 'William Shakespeare', 'ENG', 'To thine own self be true', '1564-04-26', '1616-04-23', 'M'),
 (2, 'Plato', 'GRE', 'Be kind, for everyone you meet is fighting a hard battle', '0427-01-28', '0348-01-28', 'M'),
 (3, 'George Eliot', 'ENG', 'It is never too late to be what you might have been', '1819-11-22', '1880-12-22', 'F'),
 (4, 'Kazuo Ishiguro', 'JAP', 'She had become immeasurably old in a single year', '1954-11-08', None, 'M'),
 (5, 'JK Rowling', 'ENG', 'Happiness can be found, even in the darkest of times, if one only remembers to turn on the light', '1965-07-31', None, 'F')]

In [5]:
# Retrieve the first 3 rows of the books table
%%sql 
SELECT * FROM Books LIMIT 3;

 * sqlite://
Done.

[(1, 'Henry V', '1599-10-15', 'Comedy, Drama, Historic', 129, 10.3, 4.38, 260408, 1),
 (2, 'A Midsummer Nights Dream', '1596-08-15', 'Comedy, Drama, Fantasy', 122, 10.1, 4.18, 121418, 1),
 (3, 'Macbeth', '1605-11-10', 'Comedy, Drama, Historic', 124, 9.9, 4.05, 220128, 1)]

## How to COUNT the rows
COUNT can tell us how many rows are returned.
This is often more useful than listing the rows out one by one

In [6]:
# Let's count the number of books in our database.
%%sql 

SELECT COUNT(*) FROM Books;

 * sqlite://
Done.

[(150,)]

## Tell me which COLUMNS you want.
In the examples so far, we've been retrieving a subset of rows (or entities) from the database. However, we've been including ALL the attributes. In many cases, it is better to retrieve only the columns we are interested in. We can do this with following syntax:



```
SELECT col1, col2 FROM Table T
```

For example, let's just the name of authors, along with their nationality and date of birth

In [7]:

%sql SELECT name, date_of_birth, nationality FROM Authors LIMIT 7;

 * sqlite://
Done.

[('William Shakespeare', '1564-04-26', 'ENG'),
 ('Plato', '0427-01-28', 'GRE'),
 ('George Eliot', '1819-11-22', 'ENG'),
 ('Kazuo Ishiguro', '1954-11-08', 'JAP'),
 ('JK Rowling', '1965-07-31', 'ENG'),
 ('Terry Pratchett', '1948-04-28', 'ENG'),
 ('Herman Melville', '1819-08-01', 'USA')]

# 4. Keeping Things DISTINCT
Sometimes we want to get a list of the DISTINCT values that occur in a column (or given) column. Here are two examples, showing the difference this keyword can make. We'll try to answer the question: "What nationalities are represented by the Authors in our database?"

First, let's try do this without DISTINCT:

In [8]:
%sql SELECT nationality FROM Authors LIMIT 20;

 * sqlite://
Done.

[('ENG',),
 ('GRE',),
 ('ENG',),
 ('JAP',),
 ('ENG',),
 ('ENG',),
 ('USA',),
 ('ENG',),
 ('ENG',),
 ('CAN',),
 ('ENG',),
 ('USA',),
 ('USA',),
 ('IND',),
 ('USA',),
 ('USA',),
 ('ENG',),
 ('ENG',),
 ('USA',),
 ('NGA',)]

This has a lot of duplicates! In all, it returns the following number of rows:

In [9]:
%sql SELECT COUNT(nationality) FROM Authors;

 * sqlite://
Done.

[(42,)]

Now, we can do with DISTINCT -- notice the difference!

In [10]:
%sql SELECT DISTINCT nationality FROM Authors;

 * sqlite://
Done.

[('ENG',),
 ('GRE',),
 ('JAP',),
 ('USA',),
 ('CAN',),
 ('IND',),
 ('NGA',),
 ('GER',),
 ('IRE',),
 ('UK ',),
 ('FRA',),
 ('TUR',),
 ('AFG',)]

In [11]:
# We can again COUNT the rows returned.
%sql  SELECT COUNT(DISTINCT nationality) FROM Authors;

 * sqlite://
Done.

[(13,)]

# 5. Column Aliases and ORDER BY
So far, we've basically let SQL display the rows of our SELECT queries in whatever the "default" setting happens to be. However, for real-world purposes (when we actually want to *use* this data), we often want it to be presented in particular order and format. SQL lets us do this. Here, we'll do the following:
1. Create new column labels (or "aliases") by using the AS keyword
2. Changing the order of rows by using ORDER BY

In [12]:
# To start, let's look at Book table without any sort of ordering imposed
%sql SELECT title, publication_date  FROM Books LIMIT 10;

 * sqlite://
Done.

[('Henry V', '1599-10-15'),
 ('A Midsummer Nights Dream', '1596-08-15'),
 ('Macbeth', '1605-11-10'),
 ('Romeo and Juliet', '1597-02-14'),
 ('Othello', '1604-08-10'),
 ('The Republic', '0380-01-01 BC'),
 ('Symposium', '0380-01-01 BC'),
 ('Middlemarch', '1871-12-01'),
 ('Silas Marner', '1861-12-01'),
 ('The Mill on the Floss', '1860-01-01')]

In [13]:
# Now, let's try renaming the columns
%%sql 
SELECT title as "Title of Book", publication_date AS "Y/M/D"
  FROM Books LIMIT 10;

 * sqlite://
Done.

[('Henry V', '1599-10-15'),
 ('A Midsummer Nights Dream', '1596-08-15'),
 ('Macbeth', '1605-11-10'),
 ('Romeo and Juliet', '1597-02-14'),
 ('Othello', '1604-08-10'),
 ('The Republic', '0380-01-01 BC'),
 ('Symposium', '0380-01-01 BC'),
 ('Middlemarch', '1871-12-01'),
 ('Silas Marner', '1861-12-01'),
 ('The Mill on the Floss', '1860-01-01')]

In [14]:
# OK, now let's trying ordering by the year the year the book was first published
%%sql 

SELECT title as "Title of Book", publication_date AS "Date"
  FROM Books 
  ORDER BY publication_date
  LIMIT 10;

 * sqlite://
Done.

[('The Republic', '0380-01-01 BC'),
 ('Symposium', '0380-01-01 BC'),
 ('A Midsummer Nights Dream', '1596-08-15'),
 ('Romeo and Juliet', '1597-02-14'),
 ('Henry V', '1599-10-15'),
 ('Othello', '1604-08-10'),
 ('Macbeth', '1605-11-10'),
 ('Lyrical Ballads', '1798-09-01'),
 ('Oliver Twist', '1839-02-09'),
 ('Typee', '1846-02-23')]

In [15]:
# The default sort order is "Ascending" (or ASC)
# We could also sort by "Descending" order
%%sql 

SELECT title as "Title of Book", publication_date AS "Year"
  FROM Books 
  ORDER BY publication_date DESC
  LIMIT 10;

 * sqlite://
Done.

[('The Ballad of Songbirds and Snakes', '2020-05-19'),
 ('Spinning Silver', '2018-07-10'),
 ('Uprooted', '2015-05-19'),
 ('Expecting better', '2013-01-01'),
 ('The Dark Tower: The Wind Through the Keyhole', '2012-04-24'),
 ('The Fault in Our Stars', '2012-01-10'),
 ('A Dance with Dragons', '2011-07-12'),
 ('Mockingjay', '2010-08-24'),
 ('Will Grayson, Will Grayson', '2010-04-06'),
 ('Catching Fire', '2009-09-01')]

In [16]:
# We can also sort by multiple columns
# For example, first descending by year and then ascending by title.
# strftime('%Y', publication_date) gives us just the "year" part of the date
%%sql 

SELECT title as "Title of Book", strftime('%Y', publication_date) as "Year"
  FROM Books 
  ORDER BY Year DESC, Title ASC
  LIMIT 10;

 * sqlite://
Done.

[('The Ballad of Songbirds and Snakes', '2020'),
 ('Spinning Silver', '2018'),
 ('Uprooted', '2015'),
 ('Expecting better', '2013'),
 ('The Dark Tower: The Wind Through the Keyhole', '2012'),
 ('The Fault in Our Stars', '2012'),
 ('A Dance with Dragons', '2011'),
 ('Mockingjay', '2010'),
 ('Will Grayson, Will Grayson', '2010'),
 ('Catching Fire', '2009')]

#6. Calculated Columns
SQL also allows do things like add, subtract, and divide the values of columns. Here we'll show:
1. How to use SQL to do basic arithemtic
2. How to use this to produce new "calculated columns"

In [17]:
# Let's do some simple arithmetic
%sql SELECT 7 + 21

 * sqlite://
Done.

[(28,)]

In [18]:
# The order of operations is the same one you should
# have learned in math class
%sql SELECT 3 - 2 * 4

 * sqlite://
Done.

[(-5,)]

In [19]:
# The "default" for division is integer division. So, you do NOT get decimal places.
%sql SELECT 11/5

 * sqlite://
Done.

[(2,)]

In [20]:
# We can also get the remainder from this division using the % operator
%sql select 11/5 as "Quotient", 11 % 5 as "Remainder"

 * sqlite://
Done.

[(2, 1)]

In [21]:
# To do "float" division, we just need to put a . after one of our numbers,
# which tells SQL to treat this as a FLOAT
%%sql 
SELECT 11./5 AS "What is 11 divided by 5?"

 * sqlite://
Done.

[(2.2,)]

In [22]:
# Now, let's try our hand at using this to play with books pages
%sql SELECT title, pages FROM Books LIMIT 7;

 * sqlite://
Done.

[('Henry V', 129),
 ('A Midsummer Nights Dream', 122),
 ('Macbeth', 124),
 ('Romeo and Juliet', 131),
 ('Othello', 134),
 ('The Republic', 368),
 ('Symposium', 96)]

In [23]:
# An average book has 300 words per page.
# Let's create a column the reflects this
%%sql 
SELECT title, pages, 
  (pages * 300) AS "Word Count (est.)" 
  FROM BOOKS LIMIT 7;

 * sqlite://
Done.

[('Henry V', 129, 38700),
 ('A Midsummer Nights Dream', 122, 36600),
 ('Macbeth', 124, 37200),
 ('Romeo and Juliet', 131, 39300),
 ('Othello', 134, 40200),
 ('The Republic', 368, 110400),
 ('Symposium', 96, 28800)]

In [24]:
# OK, let's say we read 1 page a minutes.
# How many hours and minutes will it take us to read the booK?
%%sql 
SELECT title,  
  pages / 60 as "Hours",
  pages % 60 as "Minutes"
  FROM Books LIMIT 10;

 * sqlite://
Done.

[('Henry V', 2, 9),
 ('A Midsummer Nights Dream', 2, 2),
 ('Macbeth', 2, 4),
 ('Romeo and Juliet', 2, 11),
 ('Othello', 2, 14),
 ('The Republic', 6, 8),
 ('Symposium', 1, 36),
 ('Middlemarch', 15, 4),
 ('Silas Marner', 3, 16),
 ('The Mill on the Floss', 11, 12)]

#7. Filtering results with WHERE, BETWEEN, and IS (NOT) NULL
So far, we've been focusing on SQL statements of the form SELECT attributes from Table. However, many/most SQL statements will also *filter* these results acccording to whether certain conditions are met. This is where WHERE comes in. For example:


```
SELECT attribute_list FROM table WHERE conditions
```

Below, we'll take a look at how this works.

In [25]:
# Find books in the database published after 2000
%%sql
SELECT title, publication_date FROM Books
  WHERE publication_date > "2000/1/1"

 * sqlite://
Done.

[('Lyras Oxford', '2003-11-04'),
 ('Oryx and Crake', '2003-08-05'),
 ('A Feast for Crows', '2005-10-17'),
 ('A Dance with Dragons', '2011-07-12'),
 ('American Gods', '2001-06-26'),
 ('Anansi Boys', '2005-09-20'),
 ('Coraline', '2002-05-27'),
 ('The Graveyard Book', '2008-09-30'),
 ('Expecting better', '2013-01-01'),
 ('Looking for Alaska', '2005-03-01'),
 ('Paper Towns', '2008-10-16'),
 ('Will Grayson, Will Grayson', '2010-04-06'),
 ('The Fault in Our Stars', '2012-01-10'),
 ('An Abundance of Katherines', '2006-09-21'),
 ('The Dark Tower: The Wind Through the Keyhole', '2012-04-24'),
 ('The Dark Tower V: Wolves of the Calla', '2003-11-05'),
 ('The Dark Tower VI: Song of Susannah', '2004-06-03'),
 ('The Dark Tower VII: The Dark Tower', '2004-09-04'),
 ('Uprooted', '2015-05-19'),
 ('Spinning Silver', '2018-07-10'),
 ('The Temeraire Series', '2007-04-24'),
 ('Victory of Eagles', '2008-04-15'),
 ('The Hunger Games', '2008-09-14'),
 ('Catching Fire', '2009-09-01'),
 ('Mockingjay', '2010-08-24'),
 ('The Ballad of Songbirds and Snakes', '2020-05-19'),
 ('Gregor the Overlander', '2003-08-01'),
 ('The Wandering Hill', '2004-01-01')]

In [26]:
# How many authors were born in English
%%sql
SELECT COUNT(*) AS "Number of English Authors" FROM Authors
  WHERE nationality = "ENG"

 * sqlite://
Done.

[(11,)]

In [27]:
# Or, we could get books with between 100 and 200 pages
# and order them by page count
%%sql 
SELECT title, pages FROM Books
  WHERE pages BETWEEN 100 AND 200
  ORDER BY pages ASC

 * sqlite://
Done.

[('On Computable Numbers', 112),
 ('Computing machinery and intelligence', 117),
 ('A Midsummer Nights Dream', 122),
 ('Macbeth', 124),
 ('Animal Farm', 128),
 ('Henry V', 129),
 ('Romeo and Juliet', 131),
 ('Othello', 134),
 ("Are You There God? It's Me, Margaret.", 144),
 ('Introduction to Semantics', 145),
 ("Then Again, Maybe I Won't", 160),
 ('The Importance of Being Earnest', 160),
 ('Superfudge', 176),
 ('Lady Windermeres Fan', 176),
 ('Tales of a Fourth Grade Nothing', 192),
 ('Coraline', 192),
 ('Philosophical Foundations of Physics', 192),
 ('Silas Marner', 196),
 ("Just As Long As We're Together", 200)]

In [57]:
# Finally, we can select just those rows have (or do not have) 
# NULL values for particular rows
%%sql
SELECT name as "Living Authors" 
  FROM Authors 
  WHERE date_of_death IS NULL 
  LIMIT 5;

UsageError: %%sql is a cell magic, but the cell body is empty. Did you mean the line magic %sql (single %)?

# 7. Searching text with LIKE and %
The LIKE operator (often used with a the %, which functions as a sort of "wildcard") allows us to search within a text field. It works as follows:


```
# returns rows where attribute begins with 'a'.
SELECT ... WHERE attribute LIKE 'a%'

# match strings ending with 'a'.
SELECT ... WHERE attribute LIKE '%a' 

# match strings with 'a' anywhere
SELECT ... WHERE attribute LIKE '%a%'
```

As you can see, we control the way LIKE searches by varying our placement of %. We can search at the beginning of a string, at the end, or anywhere in between. Let's move on to some examples.

In [38]:
# For example, let's find books that start with the string"The Dark Tower"
%sql SELECT book_id, title, publication_date FROM Books WHERE Title LIKE "The Dark Tower%";

 * sqlite://
Done.

[(135, 'The Dark Tower I: The Gunslinger', '1982-10-01'),
 (138, 'The Dark Tower II: The Drawing of the Three', '1987-05-01'),
 (139, 'The Dark Tower III: The Waste Lands', '1991-10-01'),
 (140, 'The Dark Tower IV: Wizard and Glass', '1997-10-01'),
 (141, 'The Dark Tower: The Wind Through the Keyhole', '2012-04-24'),
 (142, 'The Dark Tower V: Wolves of the Calla', '2003-11-05'),
 (143, 'The Dark Tower VI: Song of Susannah', '2004-06-03'),
 (144, 'The Dark Tower VII: The Dark Tower', '2004-09-04')]

In [55]:
# Or, we could find "famous quotes" that included "money"
%sql SELECT name, famous_quote FROM Authors WHERE famous_quote LIKE "%money%";

 * sqlite://
Done.

[('Kurt Vonnegut', 'Yes, we are doomed, doomed to spend our lives living in tall towers and making money and not caring about anybody or anything.'),
 ('Robert Lowell', 'There is no money in poetry, but then there is no poetry in money, either.')]

#8. Compound Conditions With OR, NOT, and AND

We can also use logical operators like OR, AND, and NOT to put together different conditions in the WHERE clause.

In [64]:
# Let's find out how many movies have "War" or "Star" somewhere in the title
%%sql

SELECT COUNT(*) AS "Either Star or War" FROM Movie 
  WHERE name LIke '%Star%'
  OR name LIKE '%War%';

 * sqlite://
(sqlite3.OperationalError) no such table: Movie
[SQL: SELECT COUNT(*) AS "Either Star or War" FROM Movie
  WHERE name LIke '%Star%'
  OR name LIKE '%War%';]
(Background on this error at: https://sqlalche.me/e/14/e3q8)

In [65]:
# Let's find out how many movies have "War" AND "Star" somewhere in the title
%%sql

SELECT COUNT(*) as "Both Star and War" FROM Movie 
  WHERE name LIke '%Star%'
  AND name LIKE '%War%';

 * sqlite://
(sqlite3.OperationalError) no such table: Movie
[SQL: SELECT COUNT(*) as "Both Star and War" FROM Movie
  WHERE name LIke '%Star%'
  AND name LIKE '%War%';]
(Background on this error at: https://sqlalche.me/e/14/e3q8)

In [66]:
# Let's find out how many movies have NEITHER "War" NOR "Star" anywhere in the title
%%sql

SELECT COUNT(*) AS "Neither Star nor War" FROM Movie 
  WHERE name NOT LIke '%Star%'
  AND name NOT LIKE '%War%';

 * sqlite://
(sqlite3.OperationalError) no such table: Movie
[SQL: SELECT COUNT(*) AS "Neither Star nor War" FROM Movie
  WHERE name NOT LIke '%Star%'
  AND name NOT LIKE '%War%';]
(Background on this error at: https://sqlalche.me/e/14/e3q8)

#9. Tables JOINs and table aliases
Finally we can JOIN our tables together, using shared attributes. The stucture is as follows:

```
SELECT a,b,c FROM table1 JOIN table2
  ON table1.attribute_name = table2.attribute_name
```

In [67]:
# Let's start with a simple join of movies and Oscars
%%sql
SELECT * FROM Movie JOIN Oscar
  ON Movie.id = Oscar.movie_id
  LIMIT 10;

 * sqlite://
(sqlite3.OperationalError) no such table: Movie
[SQL: SELECT * FROM Movie JOIN Oscar
  ON Movie.id = Oscar.movie_id
  LIMIT 10;]
(Background on this error at: https://sqlalche.me/e/14/e3q8)

In [68]:
# We can use this to ask question, such as "Which actors named Mark have appeared in Stars Wars movies?"
# To make our lives easier, we can use table aliases to avoid retyping the table name again and again

%%sql
SELECT DISTINCT P.name FROM Person P 
  JOIN Actor A on A.actor_id = P.id
  JOIN Movie M on A.movie_id = M.id
  WHERE M.name LIKE "Star Wars%"
  AND P.name LIKE 'Mark%';

 * sqlite://
(sqlite3.OperationalError) no such table: Person
[SQL: SELECT DISTINCT P.name FROM Person P
  JOIN Actor A on A.actor_id = P.id
  JOIN Movie M on A.movie_id = M.id
  WHERE M.name LIKE "Star Wars%"
  AND P.name LIKE 'Mark%';]
(Background on this error at: https://sqlalche.me/e/14/e3q8)

In [69]:
# Or, how about, "Can you tell me who won best director in 2010?"

%%sql
SELECT P.name FROM Person P
  JOIN Oscar O on O.person_id = P.id
  WHERE O.year = 2010
  AND O.type = 'BEST-DIRECTOR';

 * sqlite://
(sqlite3.OperationalError) no such table: Person
[SQL: SELECT P.name FROM Person P
  JOIN Oscar O on O.person_id = P.id
  WHERE O.year = 2010
  AND O.type = 'BEST-DIRECTOR';]
(Background on this error at: https://sqlalche.me/e/14/e3q8)

##10. Simple Aggregate Functions
Along with COUNT, we can also use functions like:
1. Use MAX/MIN to find the maximum or minimum values in a column.
2. Use AVG to find the average value in  a column.
3. Use SUM to sum up the results in a column.

In [70]:
# Let's find the longest runtime in the database
%%sql
SELECT MAX(runtime) FROM Movie

 * sqlite://
(sqlite3.OperationalError) no such table: Movie
[SQL: SELECT MAX(runtime) FROM Movie]
(Background on this error at: https://sqlalche.me/e/14/e3q8)

In [71]:
# Let's find the average runtime of a movies featuring
# Harrison Ford
%%sql
SELECT AVG(runtime) FROM Movie M
  JOIN Actor A on A.movie_id = M.id
  JOIN Person P on P.id = A.actor_id
  WHERE P.name = 'Harrison Ford'

 * sqlite://
(sqlite3.OperationalError) no such table: Movie
[SQL: SELECT AVG(runtime) FROM Movie M
  JOIN Actor A on A.movie_id = M.id
  JOIN Person P on P.id = A.actor_id
  WHERE P.name = 'Harrison Ford']
(Background on this error at: https://sqlalche.me/e/14/e3q8)

In [72]:
# Let's find the total length of all 
# Spider-Man movies in the database

%%sql
SELECT SUM(runtime) FROM Movie 
  WHERE name LIKE "Spider-Man%"

 * sqlite://
(sqlite3.OperationalError) no such table: Movie
[SQL: SELECT SUM(runtime) FROM Movie
  WHERE name LIKE "Spider-Man%"]
(Background on this error at: https://sqlalche.me/e/14/e3q8)

# Problems
It's time for you test out your SQL skills. Produce a query that does each of the following. In all cases, you can include a "LIMIT 5" at the end to limit the length of your results.

1. Sort the books in descending order by rating. 
2. Get the names and nationalities (and nothing else) of the authors ordered (alphabetically) by nationality, and then by first name. 
3. Get a count of the authors from the United States. 
4. Get a count of books that have between 300 and 400 pages.
5. Get the titles of the books that have ratings over 4.5 AND which have been published since 1990.
6. Get the names of the authors that are EITHER women OR are NOT from the United States.
7. Get the title of the book that has the lowest overall rating.
8. Get the average number of reviews of book where the word "Dragon" appears anywhere in the title.
9. Get the title and publication dates of the books written by Shakespeare. (NOTE: Requires a JOIN).
10. Get the name of the author who wrote the longest book in the database (NOTE: Requires a JOIN).

In [ ]:
# Problem 1

In [ ]:
# Problem 2

In [ ]:
# Problem 3

In [ ]:
# Problem 4

In [ ]:
# Problem 5

In [ ]:
# Problem 6

In [ ]:
# Problem 7

In [ ]:
# Problem 8

In [ ]:
# Problem 9

In [ ]:
# Problem 10